[
  {
    "id": 26,
    "title": "New Course",
    "category": "dsasdasda",
    "school": "sdasdsad",
    "description": "Course description coming soon!",
    "price": 2230.0,
    "available_until": "2025-03-27",
    "post_date": "2025-03-28T01:06:30.527562+00:00",
    "user": "Mentor",
    "author": "dasdasd"
  },
  {
    "id": 24,
    "title": "Sound Techniques",
    "category": "Music",
    "school": "etic_ Algarve",
    "description": "Trains professionals for the manipulation of sound and it’s equipment.\r\n\r\nDevelops skills as a technical artistic collaborator in activities related to sound.\r\n\r\nTransmit knowledge about sound recording, post production and mastering for the creative industries.\r\n\r\nPromotes the technical knowledge of the equipment and stimulates innovative creativity in the sound context.\r\n\r\nLearn from trainers who are active in the musical scene, the musical tools to transform your ideas into music on a professional level.\r\n\r\nDuring the course you have access to recording/production studios, audio post production and mastering rooms in partnership with Zipmix Studio and Coalman Recordings.\r\n\r\nBy concluding this training, you will have the possibility of participating in our European Mobility Project ERASMUS+.\r\n\r\nETIC_Algarve provides the possibility of attending a 320h Internship, for the trainees that fulfill the requirements.",
    "price": 3699.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:34:25.690416+00:00",
    "user": "Mentor",
    "author": "John Doe"
  },
  {
    "id": 23,
    "title": "Electronic Music Creation and Production",
    "category": "Music",
    "school": "etic_ Algarve",
    "description": "Trains professionals for music creation and production.\r\n\r\nDevelop skills of music production and creation for the music industry.\r\n\r\nPrepares one for traditional music creation as well as with the support of technology, by working with specialised software and equipment.\r\n\r\nPromotes musical knowledge and stimulates innovative creativity in the musical context.\r\n\r\nDuring the course you have access to recording/production studios, audio post production and mastering rooms in partnership with Zipmix Studio and Coalman Recordings.\r\n\r\nLearn from trainers who are active in the musical scene, the musical tools to transform your ideas into music on a professional level.\r\n\r\nBy concluding this training, you will have the possibility of participating in our European Mobility Project ERASMUS+.\r\n\r\nETIC_Algarve provides the possibility of attending a 320h Internship, for the trainees that fulfill the requirements of JUMP – Support to Professional Integration.",
    "price": 3499.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:33:38.800651+00:00",
    "user": "Mentor",
    "author": "John Doe"
  },
  {
    "id": 22,
    "title": "Digital Marketing and Social Media",
    "category": "Marketing",
    "school": "etic_ Algarve",
    "description": "FROM: Following online trends 🤳 TO: Becoming the trendsetter in the digital world 📊\r\nPrepare to be a complete professional capable of planning, managing, and optimizing Digital Marketing strategies focused on results, combining organic and paid content, SEO, social media, email marketing, and data analysis.\r\n\r\nUpon completing this programme, you will have the opportunity to participate in our ERASMUS+ European mobility project.\r\n\r\nETIC_Algarve offers the possibility of a 320-hour internship for students who meet the requirements of JUMP – Professional Integration Support.",
    "price": 3599.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:33:05.675098+00:00",
    "user": "Mentor",
    "author": "Jane Doe"
  },
  {
    "id": 21,
    "title": "Photography",
    "category": "Photography",
    "school": "etic_ Algarve",
    "description": "Qualifies to start Photographic practice in the fields of: Portrait, Advertisement, Real Estate or Architecture and Photojournalism.\r\n\r\nDevelop theoretical and practical skills of handling and operating the equipment and of photographic post production.\r\n\r\nRaises awareness on the usage of photography as a form of expression, visual and artistic communication.\r\n\r\nBy concluding this training, you will have the possibility of participating in our European Mobility Project ERASMUS+.\r\n\r\nETIC_Algarve provides the possibility of attending a 320h Internship, for the trainees that fulfill the requirements of JUMP – Support to Professional Integration.",
    "price": 3499.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:32:23.997717+00:00",
    "user": "Mentor",
    "author": "Jane Doe"
  },
  {
    "id": 20,
    "title": "Graphic Design",
    "category": "Design",
    "school": "etic_ Algarve",
    "description": "Trains Design professionals able to produce visual communication projects for brands, products and services.\r\n\r\nProvides specialised skills in image editing tools, typography treatment and vectorial drawing.\r\n\r\nDevelops creative skills and techniques for the elaboration of visual identity projects for brands, publicity campaigns and editorial design.\r\n\r\nProvides skills for creating and monitoring projects with and for real clients.\r\n\r\nBy concluding this training, you will have the possibility of participating in our European Mobility Project ERASMUS+.\r\n\r\nETIC_Algarve provides the possibility of attending a 320h Internship, for the trainees that fulfill the requirements of JUMP – Support to Professional Integration.",
    "price": 3899.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:31:53.843544+00:00",
    "user": "Mentor",
    "author": "Jane Doe"
  },
  {
    "id": 19,
    "title": "Concept Art",
    "category": "Art",
    "school": "etic_ Algarve",
    "description": "This course allows to develop practical skills in character and scenery drawing for video games conceptual art.\r\n\r\nAt the base of entertainment industry, there is a need for artists who can define concepts from thin air or basic ideas, for all the elements that compose games and movies we appreciate so much. Artists with the skill to incorporate aesthetic, cultural and technical elements to create characters, adversaries, backgrounds, machines and creatures for diverse media.\r\n\r\nBy concluding this training, you will have the possibility of participating in our European Mobility Project ERASMUS+.\r\n\r\nETIC_Algarve provides the possibility of attending a 320h Internship, for the trainees that fulfill the requirements of JUMP – Support to Professional Integration.",
    "price": 3699.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:30:25.922009+00:00",
    "user": "Mentor",
    "author": "Jane Doe"
  },
  {
    "id": 18,
    "title": "Video Games - Developer & Designer",
    "category": "Programing",
    "school": "etic_ Algarve",
    "description": "Trains professionals suited to develop multimedia entertainment projects, from conception to commercialization of a video game.\r\n\r\nTeaches skills and tools necessary to develop and produce a video game;\r\n\r\nProvides the fundamental concepts of Game Design and its components (mechanic and dynamic);\r\n\r\nAttributes skills for the development of a game prototype;\r\n\r\nTransmits knowledge about programming, art and animation, interface and user experience, fundamental notions of 3D and sound;\r\n\r\nProvides the understanding of the work market and its economical models.",
    "price": 7700.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:29:51.989696+00:00",
    "user": "Mentor",
    "author": "John Doe"
  },
  {
    "id": 17,
    "title": "Directing For Cinema And TV",
    "category": "Cinematography",
    "school": "etic_ Algarve",
    "description": "Develops technical and creative skills for creation of audiovisual contents for the video, cinema and television industries.\r\n\r\nTransmits knowledge about camera operation, lighting and sound, as well as the fundamental training to integrate in any phase of the development of an audiovisual project: directing, pre-production, production, post-production and editing.\r\n\r\nPromotes research, analysis and the practice of themes inherent to the creation of audiovisual contents.\r\n\r\nDevelops professional skills necessary for the integration in the audiovisual world and context.",
    "price": 8399.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:28:57.936303+00:00",
    "user": "Mentor",
    "author": "John Doe"
  },
  {
    "id": 16,
    "title": "Web Development - Full Stack",
    "category": "Programing",
    "school": "etic_ Algarve",
    "description": "How to talk to machines\r\n\r\nWith the extreme technological advances that the world has been going through lately, there is a huge need in the job market to hire IT professionals capable of developing Cloud-based solutions that are also interactive and appealing to their users.\r\n\r\nIn this course, you will learn the necessary concepts to work on the web and in the cloud, using technologies such as HTML, CSS, Javascript, Python, Github, Docker, etc.\r\n\r\nThe aim is for trainees to be able to develop a web project in all its aspects: Backend, Frontend, Infrastructure, etc.",
    "price": 8499.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:28:07.832834+00:00",
    "user": "Mentor",
    "author": "John Doe"
  },
  {
    "id": 15,
    "title": "Songwriting",
    "category": "Music",
    "school": "etic_ algarve",
    "description": "FROM: Writing lyrics in phone notes 📱 TO: Composing catchy songs that stick with you!\r\nIntegrate into the music industry by developing skills in writing and composition, idea creation and direction, demo creation, pre-production, recording basics, and performance. Introduction to recording and music creation software and mixing techniques.\r\n\r\nLearn about the music market processes and the basic tools to create and execute an original idea in various musical genres.\r\n\r\nUpon completing this programme, you will have the opportunity to participate in our European mobility project ERASMUS+.\r\n\r\nETIC_Algarve offers the possibility of a 320-hour internship for students who meet the requirements of JUMP – Professional Integration Support.",
    "price": 3699.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:26:55.661136+00:00",
    "user": "Mentor",
    "author": "John Doe"
  },
  {
    "id": 14,
    "title": "Post-Production of Video and VFX",
    "category": "Videography",
    "school": "etic_ Algarve",
    "description": "Become a professional capable of applying visual effects techniques in cinematic productions, from filming to post-production, using industry-standard software, addressing the integration of VFX with image capture.\r\n\r\nGain expertise in the entire audiovisual post-production pipeline, from basic theoretical foundations to advanced techniques in digital compositing, 3D tracking, object animation, and colour grading.\r\n\r\nAcquire skills in software such as Premiere Pro, Blender, Red Giant, After Effects, and DaVinci Resolve. Prepare to create audiovisual projects that integrate CGI (Computer Generated Imagery), motion graphics, and live-action, culminating in the production of a competitive professional portfolio for the national and international VFX market.\r\n\r\nDevelops professional skills necessary for the integration in the audiovisual world and context.",
    "price": 3599.98,
    "available_until": "2025-04-10",
    "post_date": "2025-03-28T00:26:14.349240+00:00",
    "user": "Mentor",
    "author": "John Doe"
  },
  {
    "id": 13,
    "title": "Professional Photography",
    "category": "Photography",
    "school": "etic_ Algarve",
    "description": "Trains professionals with creative and technical skills necessary for photographic practice in the various areas of photography.\r\n\r\nDevelop creative and technical skills for the practice of photography applied to different contexts: Advertisement, Fashion, Journalism, Portrait, Nude, Events Real Estate/ A rchitecture and Post-Production\r\n\r\nSensitizes the usage of photography as a form of artistic expression and visual communication.\r\n\r\nTransmits knowledge about all the photographic production process, from scheduling, to execution and printing.",
    "price": 8699.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:25:35.930419+00:00",
    "user": "Mentor",
    "author": "Jane Doe"
  },
  {
    "id": 12,
    "title": "Communication Design & Multimedia",
    "category": "Design",
    "school": "etic_ Algarve",
    "description": "Comprehensive knowledge about the fundamental communication design subjects as well as for the new media: multimedia, web design, video editing, etc.\r\n\r\nProvide a wide and complete knowledge about the essential elements for the elaboration of a graphic project.\r\nExpand the acquired technical and aesthetical basics to the new media.\r\n\r\nCreation and development of experiences, interfaces and interactive digital content (websites, apps, social media, etc.);\r\n\r\nCreate solutions with a 3D software, allowing to build simple three dimensional objects.\r\n\r\nEditing, post-producing, planning and structuring a video project.",
    "price": 9599.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:23:35.345635+00:00",
    "user": "Mentor",
    "author": "John Doe"
  },
  {
    "id": 11,
    "title": "Music Creation, Production And Sound Techniques",
    "category": "Music",
    "school": "etic_ Algarve",
    "description": "From the studio to the live act, from the sound mixing table of a live concert, the production, creation to mastering.\r\n\r\nIntegration in the musical scene through the development of writing and composition skills, as well as technical knowledge about studio and live performance and production.\r\n\r\nStudio and mixing table practice, recording and editing software, perception of mixing equilibrium and the mastering process.\r\n\r\nDuring the course you will have access to recording/production studios, audio post-production and mastering rooms, stage concert environments, in partnership with Zipmix Studio and Coalman Recordings.\r\n\r\nLearn from trainers who are active in the musical scene, the necessary tools to transform your ideas into music, at a professional level.",
    "price": 8099.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:21:30.712448+00:00",
    "user": "Mentor",
    "author": "John Doe"
  },
  {
    "id": 10,
    "title": "Communication Design and Digital Marketing",
    "category": "Marketing",
    "school": "etic_ Algarve",
    "description": "Develop your creativity and skillset and become a professional in Communication Design and Digital Marketing.\r\n\r\nThis course offers comprehensive training that prepares you for today's labour market, combining knowledge in Communication Design and Digital Marketing.\r\n\r\nAdvertising and Marketing Strategies: define business objectives, analyse the market and create an effective marketing plan.\r\nSocial Media Management: develop a content strategy, create post calendars and manage communication crises.\r\nAdvanced Content Creation: hone your skills in Photography, Videography, Sound and explore emerging technologies such as AI, AR and VR.\r\nPerformance Marketing : optimise online campaigns, create landing pages and use data analysis tools to make strategic decisions.\r\nImplement metrics and interpret data for decision-making.",
    "price": 8699.99,
    "available_until": "2025-10-01",
    "post_date": "2025-03-28T00:20:10.140297+00:00",
    "user": "Mentor",
    "author": "Jane Doe"
  }
]